In [1]:
import pandas as pd
df = pd.read_csv('/content/train.csv')
print(df) #GETTING AND READING FILE INTO NOTEBOOK

      Unnamed: 0                              Name    Location  Year  \
0              1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1              2                      Honda Jazz V     Chennai  2011
2              3                 Maruti Ertiga VDI     Chennai  2012
3              4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4              6            Nissan Micra Diesel XV      Jaipur  2013
...          ...                               ...         ...   ...
5842        6014                  Maruti Swift VDI       Delhi  2014
5843        6015          Hyundai Xcent 1.1 CRDi S      Jaipur  2015
5844        6016             Mahindra Xylo D4 BSIV      Jaipur  2012
5845        6017                Maruti Wagon R VXI     Kolkata  2013
5846        6018             Chevrolet Beat Diesel   Hyderabad  2011

      Kilometers_Driven Fuel_Type Transmission Owner_Type     Mileage  \
0                 41000    Diesel       Manual      First  19.67 kmpl
1                 46000    Petrol       Manual      First    13 km/kg
2                 87000    Diesel       Manual      First  20.77 kmpl
3                 40670    Diesel    Automatic     Second   15.2 kmpl
4                 86999    Diesel       Manual      First  23.08 kmpl
...                 ...       ...          ...        ...         ...
5842              27365    Diesel       Manual      First   28.4 kmpl
5843             100000    Diesel       Manual      First   24.4 kmpl
5844              55000    Diesel       Manual     Second   14.0 kmpl
5845              46000    Petrol       Manual      First   18.9 kmpl
5846              47000    Diesel       Manual      First  25.44 kmpl

       Engine      Power  Seats  New_Price  Price
0     1582 CC  126.2 bhp    5.0        NaN  12.50
1     1199 CC   88.7 bhp    5.0  8.61 Lakh   4.50
2     1248 CC  88.76 bhp    7.0        NaN   6.00
3     1968 CC  140.8 bhp    5.0        NaN  17.74
4     1461 CC   63.1 bhp    5.0        NaN   3.50
...       ...        ...    ...        ...    ...
5842  1248 CC     74 bhp    5.0  7.88 Lakh   4.75
5843  1120 CC     71 bhp    5.0        NaN   4.00
5844  2498 CC    112 bhp    8.0        NaN   2.90
5845   998 CC   67.1 bhp    5.0        NaN   2.65
5846   936 CC   57.6 bhp    5.0        NaN   2.50

[5847 rows x 14 columns]

In [2]:
print(df.columns) #CHECKING NAMES OF COLUMNS
num_rows = len(df)
print("Number of rows:", num_rows) # checking number of rows

Index(['Unnamed: 0', 'Name', 'Location', 'Year', 'Kilometers_Driven',
       'Fuel_Type', 'Transmission', 'Owner_Type', 'Mileage', 'Engine', 'Power',
       'Seats', 'New_Price', 'Price'],
      dtype='object')
Number of rows: 5847

QUESTION:1 A) Look for the missing values in all the columns and either impute them (replace with mean, median, or mode) or drop them. Justify your action for this task.

In [3]:
missing_values = df.isnull().sum()
print("Missing values per column:")
print(missing_values)

Missing values per column:
Unnamed: 0              0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 36
Power                  36
Seats                  38
New_Price            5032
Price                   0
dtype: int64

Here i have missing values in Columns Mileage, Engine, Power, Seats, New_Price the parameters for the car is depends on engine conditions and maintaince of car so we cant imute so i am dropping them . Firstly i am removing the column New_Price beacuse it has only limited values that doesnt fetch or use to dataset. and then i proceed to removing missing value rows

In [4]:
column_to_drop = 'New_Price' #droping entire column
df = df.drop(column_to_drop, axis=1)
print(df.columns)

Index(['Unnamed: 0', 'Name', 'Location', 'Year', 'Kilometers_Driven',
       'Fuel_Type', 'Transmission', 'Owner_Type', 'Mileage', 'Engine', 'Power',
       'Seats', 'Price'],
      dtype='object')

In [5]:
df.dropna(inplace=True) #droping the missing values in row
missing_values = df.isnull().sum()#checking the missing values after droping them
print("Missing values per column:")
print(missing_values)

Missing values per column:
Unnamed: 0           0
Name                 0
Location             0
Year                 0
Kilometers_Driven    0
Fuel_Type            0
Transmission         0
Owner_Type           0
Mileage              0
Engine               0
Power                0
Seats                0
Price                0
dtype: int64

Question:2

B)Remove the units from some of the attributes and only keep the numerical values (for example remove kmpl from “Mileage”, CC from“Engine”, bhp from “Power”, and lakh from “New_price”)

Here they are having units to three attributes like Mileage, Engine, Power

In [6]:
df['Mileage'] = df['Mileage'].str.extract(r'(\d+)').astype(float) # removing unit to Mileage column
df['Engine'] = df['Engine'].str.extract(r'(\d+)').astype(int) #remloving unit to Engine Column
df['Power'] = df['Power'].str.extract(r'(\d+)').astype(float) #removing units from Power column

In [7]:
print(df)

      Unnamed: 0                              Name    Location  Year  \
0              1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1              2                      Honda Jazz V     Chennai  2011
2              3                 Maruti Ertiga VDI     Chennai  2012
3              4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4              6            Nissan Micra Diesel XV      Jaipur  2013
...          ...                               ...         ...   ...
5842        6014                  Maruti Swift VDI       Delhi  2014
5843        6015          Hyundai Xcent 1.1 CRDi S      Jaipur  2015
5844        6016             Mahindra Xylo D4 BSIV      Jaipur  2012
5845        6017                Maruti Wagon R VXI     Kolkata  2013
5846        6018             Chevrolet Beat Diesel   Hyderabad  2011

      Kilometers_Driven Fuel_Type Transmission Owner_Type  Mileage  Engine  \
0                 41000    Diesel       Manual      First     19.0    1582
1                 46000    Petrol       Manual      First     13.0    1199
2                 87000    Diesel       Manual      First     20.0    1248
3                 40670    Diesel    Automatic     Second     15.0    1968
4                 86999    Diesel       Manual      First     23.0    1461
...                 ...       ...          ...        ...      ...     ...
5842              27365    Diesel       Manual      First     28.0    1248
5843             100000    Diesel       Manual      First     24.0    1120
5844              55000    Diesel       Manual     Second     14.0    2498
5845              46000    Petrol       Manual      First     18.0     998
5846              47000    Diesel       Manual      First     25.0     936

      Power  Seats  Price
0     126.0    5.0  12.50
1      88.0    5.0   4.50
2      88.0    7.0   6.00
3     140.0    5.0  17.74
4      63.0    5.0   3.50
...     ...    ...    ...
5842   74.0    5.0   4.75
5843   71.0    5.0   4.00
5844  112.0    8.0   2.90
5845   67.0    5.0   2.65
5846   57.0    5.0   2.50

[5807 rows x 13 columns]

 Question:3

Change the categorical variables (“Fuel_Type” and “Transmission”) into numerical one hot encoded value

In [8]:
df_encoded = pd.get_dummies(df, columns=['Fuel_Type', 'Transmission']) #here i use get dummies fuction to convert categorical variables into one hot encoded value

# Display the DataFrame after encoding
print("\nDataFrame after encoding:")
print(df_encoded)

DataFrame after encoding:
      Unnamed: 0                              Name    Location  Year  \
0              1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1              2                      Honda Jazz V     Chennai  2011
2              3                 Maruti Ertiga VDI     Chennai  2012
3              4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4              6            Nissan Micra Diesel XV      Jaipur  2013
...          ...                               ...         ...   ...
5842        6014                  Maruti Swift VDI       Delhi  2014
5843        6015          Hyundai Xcent 1.1 CRDi S      Jaipur  2015
5844        6016             Mahindra Xylo D4 BSIV      Jaipur  2012
5845        6017                Maruti Wagon R VXI     Kolkata  2013
5846        6018             Chevrolet Beat Diesel   Hyderabad  2011

      Kilometers_Driven Owner_Type  Mileage  Engine  Power  Seats  Price  \
0                 41000      First     19.0    1582  126.0    5.0  12.50
1                 46000      First     13.0    1199   88.0    5.0   4.50
2                 87000      First     20.0    1248   88.0    7.0   6.00
3                 40670     Second     15.0    1968  140.0    5.0  17.74
4                 86999      First     23.0    1461   63.0    5.0   3.50
...                 ...        ...      ...     ...    ...    ...    ...
5842              27365      First     28.0    1248   74.0    5.0   4.75
5843             100000      First     24.0    1120   71.0    5.0   4.00
5844              55000     Second     14.0    2498  112.0    8.0   2.90
5845              46000      First     18.0     998   67.0    5.0   2.65
5846              47000      First     25.0     936   57.0    5.0   2.50

      Fuel_Type_Diesel  Fuel_Type_Petrol  Transmission_Automatic  \
0                    1                 0                       0
1                    0                 1                       0
2                    1                 0                       0
3                    1                 0                       1
4                    1                 0                       0
...                ...               ...                     ...
5842                 1                 0                       0
5843                 1                 0                       0
5844                 1                 0                       0
5845                 0                 1                       0
5846                 1                 0                       0

      Transmission_Manual
0                       1
1                       1
2                       1
3                       0
4                       1
...                   ...
5842                    1
5843                    1
5844                    1
5845                    1
5846                    1

[5807 rows x 15 columns]

Question:4

Create one more feature and add this column to the dataset.

In [9]:
from datetime import datetime
# Calculate the current year
current_year = datetime.now().year

# Calculate the age of the car
df['Current_Age'] = current_year - df['Year']

# Display the DataFrame with the new feature
print(df)

      Unnamed: 0                              Name    Location  Year  \
0              1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1              2                      Honda Jazz V     Chennai  2011
2              3                 Maruti Ertiga VDI     Chennai  2012
3              4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4              6            Nissan Micra Diesel XV      Jaipur  2013
...          ...                               ...         ...   ...
5842        6014                  Maruti Swift VDI       Delhi  2014
5843        6015          Hyundai Xcent 1.1 CRDi S      Jaipur  2015
5844        6016             Mahindra Xylo D4 BSIV      Jaipur  2012
5845        6017                Maruti Wagon R VXI     Kolkata  2013
5846        6018             Chevrolet Beat Diesel   Hyderabad  2011

      Kilometers_Driven Fuel_Type Transmission Owner_Type  Mileage  Engine  \
0                 41000    Diesel       Manual      First     19.0    1582
1                 46000    Petrol       Manual      First     13.0    1199
2                 87000    Diesel       Manual      First     20.0    1248
3                 40670    Diesel    Automatic     Second     15.0    1968
4                 86999    Diesel       Manual      First     23.0    1461
...                 ...       ...          ...        ...      ...     ...
5842              27365    Diesel       Manual      First     28.0    1248
5843             100000    Diesel       Manual      First     24.0    1120
5844              55000    Diesel       Manual     Second     14.0    2498
5845              46000    Petrol       Manual      First     18.0     998
5846              47000    Diesel       Manual      First     25.0     936

      Power  Seats  Price  Current_Age
0     126.0    5.0  12.50            9
1      88.0    5.0   4.50           13
2      88.0    7.0   6.00           12
3     140.0    5.0  17.74           11
4      63.0    5.0   3.50           11
...     ...    ...    ...          ...
5842   74.0    5.0   4.75           10
5843   71.0    5.0   4.00            9
5844  112.0    8.0   2.90           12
5845   67.0    5.0   2.65           11
5846   57.0    5.0   2.50           13

[5807 rows x 14 columns]

Adding new feature Called Avg Kilometers drivren by car per each year as Column "Avg Kms/year"

In [10]:
df['Avg_kms_per_yr'] = df['Kilometers_Driven']/df['Year']

In [11]:
print(df.columns)
print(df)

Index(['Unnamed: 0', 'Name', 'Location', 'Year', 'Kilometers_Driven',
       'Fuel_Type', 'Transmission', 'Owner_Type', 'Mileage', 'Engine', 'Power',
       'Seats', 'Price', 'Current_Age', 'Avg_kms_per_yr'],
      dtype='object')
      Unnamed: 0                              Name    Location  Year  \
0              1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1              2                      Honda Jazz V     Chennai  2011
2              3                 Maruti Ertiga VDI     Chennai  2012
3              4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4              6            Nissan Micra Diesel XV      Jaipur  2013
...          ...                               ...         ...   ...
5842        6014                  Maruti Swift VDI       Delhi  2014
5843        6015          Hyundai Xcent 1.1 CRDi S      Jaipur  2015
5844        6016             Mahindra Xylo D4 BSIV      Jaipur  2012
5845        6017                Maruti Wagon R VXI     Kolkata  2013
5846        6018             Chevrolet Beat Diesel   Hyderabad  2011

      Kilometers_Driven Fuel_Type Transmission Owner_Type  Mileage  Engine  \
0                 41000    Diesel       Manual      First     19.0    1582
1                 46000    Petrol       Manual      First     13.0    1199
2                 87000    Diesel       Manual      First     20.0    1248
3                 40670    Diesel    Automatic     Second     15.0    1968
4                 86999    Diesel       Manual      First     23.0    1461
...                 ...       ...          ...        ...      ...     ...
5842              27365    Diesel       Manual      First     28.0    1248
5843             100000    Diesel       Manual      First     24.0    1120
5844              55000    Diesel       Manual     Second     14.0    2498
5845              46000    Petrol       Manual      First     18.0     998
5846              47000    Diesel       Manual      First     25.0     936

      Power  Seats  Price  Current_Age  Avg_kms_per_yr
0     126.0    5.0  12.50            9       20.347395
1      88.0    5.0   4.50           13       22.874192
2      88.0    7.0   6.00           12       43.240557
3     140.0    5.0  17.74           11       20.203676
4      63.0    5.0   3.50           11       43.218579
...     ...    ...    ...          ...             ...
5842   74.0    5.0   4.75           10       13.587388
5843   71.0    5.0   4.00            9       49.627792
5844  112.0    8.0   2.90           12       27.335984
5845   67.0    5.0   2.65           11       22.851465
5846   57.0    5.0   2.50           13       23.371457

[5807 rows x 15 columns]

Question:5

Perform select, filter, rename, mutate, arrange and summarize with group by operations (or their equivalent operations in python) on this dataset

I am performning select, filter, rename, mutate, arrange and summarize with group by operations using certain operations python using pandas library mentioned in  below

In [14]:
# Select specific columns
selected_columns = df[['Name', 'Current_Age']]

print("Selected columns:")
print(selected_columns)

Selected columns:
                                  Name  Current_Age
0     Hyundai Creta 1.6 CRDi SX Option            9
1                         Honda Jazz V           13
2                    Maruti Ertiga VDI           12
3      Audi A4 New 2.0 TDI Multitronic           11
4               Nissan Micra Diesel XV           11
...                                ...          ...
5842                  Maruti Swift VDI           10
5843          Hyundai Xcent 1.1 CRDi S            9
5844             Mahindra Xylo D4 BSIV           12
5845                Maruti Wagon R VXI           11
5846             Chevrolet Beat Diesel           13

[5807 rows x 2 columns]

In [13]:
average_kilometers_driven = df['Kilometers_Driven'].mean()

# Print the average value
print("Average Kilometers Driven:", average_kilometers_driven)

Average Kilometers Driven: 58349.023247804376

In [16]:
# Filter rows based on conditions
filtered_data = df[df['Kilometers_Driven'] < 59000] #here avg value of kms driven is taken as base value for condition in filteration
print("\nFiltered data:")
print(filtered_data)

Filtered data:
      Unnamed: 0                                 Name    Location  Year  \
0              1     Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1              2                         Honda Jazz V     Chennai  2011
3              4      Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
5              7    Toyota Innova Crysta 2.8 GX AT 8S      Mumbai  2016
8             10                     Maruti Ciaz Zeta       Kochi  2018
...          ...                                  ...         ...   ...
5840        6012  Toyota Innova 2.5 V Diesel 7-seater  Coimbatore  2011
5842        6014                     Maruti Swift VDI       Delhi  2014
5844        6016                Mahindra Xylo D4 BSIV      Jaipur  2012
5845        6017                   Maruti Wagon R VXI     Kolkata  2013
5846        6018                Chevrolet Beat Diesel   Hyderabad  2011

      Kilometers_Driven Fuel_Type Transmission Owner_Type  Mileage  Engine  \
0                 41000    Diesel       Manual      First     19.0    1582
1                 46000    Petrol       Manual      First     13.0    1199
3                 40670    Diesel    Automatic     Second     15.0    1968
5                 36000    Diesel    Automatic      First     11.0    2755
8                 25692    Petrol       Manual      First     21.0    1462
...                 ...       ...          ...        ...      ...     ...
5840              45004    Diesel       Manual      First     12.0    2494
5842              27365    Diesel       Manual      First     28.0    1248
5844              55000    Diesel       Manual     Second     14.0    2498
5845              46000    Petrol       Manual      First     18.0     998
5846              47000    Diesel       Manual      First     25.0     936

      Power  Seats  Price  Current_Age  Avg_kms_per_yr
0     126.0    5.0  12.50            9       20.347395
1      88.0    5.0   4.50           13       22.874192
3     140.0    5.0  17.74           11       20.203676
5     171.0    8.0  17.50            8       17.857143
8     103.0    5.0   9.95            6       12.731417
...     ...    ...    ...          ...             ...
5840  102.0    7.0   9.48           13       22.378916
5842   74.0    5.0   4.75           10       13.587388
5844  112.0    8.0   2.90           12       27.335984
5845   67.0    5.0   2.65           11       22.851465
5846   57.0    5.0   2.50           13       23.371457

[3383 rows x 15 columns]

In [18]:
# Rename columns
df.rename(columns={'Current_Age': 'Age_of_car'}, inplace=True)
print("\nRenamed DataFrame:")
print(df)

Renamed DataFrame:
      Unnamed: 0                              Name    Location  Year  \
0              1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1              2                      Honda Jazz V     Chennai  2011
2              3                 Maruti Ertiga VDI     Chennai  2012
3              4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4              6            Nissan Micra Diesel XV      Jaipur  2013
...          ...                               ...         ...   ...
5842        6014                  Maruti Swift VDI       Delhi  2014
5843        6015          Hyundai Xcent 1.1 CRDi S      Jaipur  2015
5844        6016             Mahindra Xylo D4 BSIV      Jaipur  2012
5845        6017                Maruti Wagon R VXI     Kolkata  2013
5846        6018             Chevrolet Beat Diesel   Hyderabad  2011

      Kilometers_Driven Fuel_Type Transmission Owner_Type  Mileage  Engine  \
0                 41000    Diesel       Manual      First     19.0    1582
1                 46000    Petrol       Manual      First     13.0    1199
2                 87000    Diesel       Manual      First     20.0    1248
3                 40670    Diesel    Automatic     Second     15.0    1968
4                 86999    Diesel       Manual      First     23.0    1461
...                 ...       ...          ...        ...      ...     ...
5842              27365    Diesel       Manual      First     28.0    1248
5843             100000    Diesel       Manual      First     24.0    1120
5844              55000    Diesel       Manual     Second     14.0    2498
5845              46000    Petrol       Manual      First     18.0     998
5846              47000    Diesel       Manual      First     25.0     936

      Power  Seats  Price  Age_of_car  Avg_kms_per_yr
0     126.0    5.0  12.50           9       20.347395
1      88.0    5.0   4.50          13       22.874192
2      88.0    7.0   6.00          12       43.240557
3     140.0    5.0  17.74          11       20.203676
4      63.0    5.0   3.50          11       43.218579
...     ...    ...    ...         ...             ...
5842   74.0    5.0   4.75          10       13.587388
5843   71.0    5.0   4.00           9       49.627792
5844  112.0    8.0   2.90          12       27.335984
5845   67.0    5.0   2.65          11       22.851465
5846   57.0    5.0   2.50          13       23.371457

[5807 rows x 15 columns]

In [19]:
# Mutate: Create a new column based on existing columns
df['Avg_kms_per_yr'] = df['Kilometers_Driven']/df['Year']
print("\nMutated DataFrame:")
print(df)

Mutated DataFrame:
      Unnamed: 0                              Name    Location  Year  \
0              1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1              2                      Honda Jazz V     Chennai  2011
2              3                 Maruti Ertiga VDI     Chennai  2012
3              4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4              6            Nissan Micra Diesel XV      Jaipur  2013
...          ...                               ...         ...   ...
5842        6014                  Maruti Swift VDI       Delhi  2014
5843        6015          Hyundai Xcent 1.1 CRDi S      Jaipur  2015
5844        6016             Mahindra Xylo D4 BSIV      Jaipur  2012
5845        6017                Maruti Wagon R VXI     Kolkata  2013
5846        6018             Chevrolet Beat Diesel   Hyderabad  2011

      Kilometers_Driven Fuel_Type Transmission Owner_Type  Mileage  Engine  \
0                 41000    Diesel       Manual      First     19.0    1582
1                 46000    Petrol       Manual      First     13.0    1199
2                 87000    Diesel       Manual      First     20.0    1248
3                 40670    Diesel    Automatic     Second     15.0    1968
4                 86999    Diesel       Manual      First     23.0    1461
...                 ...       ...          ...        ...      ...     ...
5842              27365    Diesel       Manual      First     28.0    1248
5843             100000    Diesel       Manual      First     24.0    1120
5844              55000    Diesel       Manual     Second     14.0    2498
5845              46000    Petrol       Manual      First     18.0     998
5846              47000    Diesel       Manual      First     25.0     936

      Power  Seats  Price  Age_of_car  Avg_kms_per_yr
0     126.0    5.0  12.50           9       20.347395
1      88.0    5.0   4.50          13       22.874192
2      88.0    7.0   6.00          12       43.240557
3     140.0    5.0  17.74          11       20.203676
4      63.0    5.0   3.50          11       43.218579
...     ...    ...    ...         ...             ...
5842   74.0    5.0   4.75          10       13.587388
5843   71.0    5.0   4.00           9       49.627792
5844  112.0    8.0   2.90          12       27.335984
5845   67.0    5.0   2.65          11       22.851465
5846   57.0    5.0   2.50          13       23.371457

[5807 rows x 15 columns]

In [21]:
# Arrange: Sort the DataFrame based on a column
sorted_df = df.sort_values(by='Year')
print("\nSorted DataFrame:")
print(sorted_df)

Sorted DataFrame:
      Unnamed: 0                                    Name    Location  Year  \
3039        3138                          Maruti Zen LXI      Jaipur  1998
5558        5716                           Maruti Zen LX      Jaipur  1998
3630        3749       Mercedes-Benz E-Class 250 D W 210      Mumbai  1998
1791        1845                      Honda City 1.3 EXI        Pune  1999
1185        1224                           Maruti Zen VX      Jaipur  1999
...          ...                                     ...         ...   ...
5455        5610               Hyundai Verna 1.6 SX VTVT  Coimbatore  2019
976         1010  Ford Ecosport Signature Edition Diesel  Coimbatore  2019
974         1008             Maruti Omni E MPI STD BS IV       Kochi  2019
226          235          Toyota Innova Crysta 2.8 GX AT       Kochi  2019
506          526                        Maruti Swift VXI       Kochi  2019

      Kilometers_Driven Fuel_Type Transmission Owner_Type  Mileage  Engine  \
3039              95150    Petrol       Manual      Third     17.0     993
5558              95150    Petrol       Manual      Third     17.0     993
3630              55300    Diesel    Automatic      First     10.0    1796
1791             140000    Petrol       Manual      First     13.0    1343
1185              70000    Petrol       Manual     Second     17.0     993
...                 ...       ...          ...        ...      ...     ...
5455               6028    Petrol       Manual      First     17.0    1591
976               23154    Diesel       Manual      First     23.0    1498
974               11571    Petrol       Manual      First     16.0     796
226               14165    Diesel    Automatic      First     11.0    2755
506               20667    Petrol       Manual      First     22.0    1197

      Power  Seats  Price  Age_of_car  Avg_kms_per_yr
3039   60.0    5.0   0.45          26       47.622623
5558   60.0    5.0   0.53          26       47.622623
3630  157.0    5.0   3.90          26       27.677678
1791   90.0    5.0   0.90          25       70.035018
1185   60.0    5.0   0.77          25       35.017509
...     ...    ...    ...         ...             ...
5455  121.0    5.0  11.54           5        2.985636
976    98.0    5.0  11.65           5       11.468053
974    34.0    8.0   3.80           5        5.731055
226   171.0    7.0  19.64           5        7.015849
506    81.0    5.0   6.37           5       10.236256

[5807 rows x 15 columns]

In [24]:
# Select particular columns for summarization
columns_to_summarize = ['Seats', 'Mileage', 'Age_of_car']

# Use describe() function to summarize the selected columns
summary = df[columns_to_summarize].describe()

# Print the summary statistics
print(summary)

             Seats      Mileage   Age_of_car
count  5807.000000  5807.000000  5807.000000
mean      5.286551    17.775788    10.524195
std       0.806790     4.300543     3.170718
min       2.000000     0.000000     5.000000
25%       5.000000    15.000000     8.000000
50%       5.000000    18.000000    10.000000
75%       5.000000    21.000000    12.000000
max      10.000000    28.000000    26.000000